Reports/ххх_СостояниеВесов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Report>
		<Properties>
			<Name>ххх_СостояниеВесов</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ххх_КодыНоменклатурыВесыКассы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ххх_КодыНоменклатурыВесыКассы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Инкримента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДляСостава</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ххх_ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ххх_КодыНоменклатурыВесыКассыТекущееСостояние.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ххх_КодыНоменклатурыВесыКассыТекущееСостояние</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ххх_ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/ххх_СостояниеВесов/Forms/ххх_СостояниеВесов/Ext/Form/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	Запрос=Новый запрос;
	Запрос.УстановитьПараметр("оборудование",оборудование);
	Запрос.Текст="ВЫБРАТЬ
	             |	СостояниеВБазе.Код КАК НомерЯчейки,
	             |	ВЫБОР
	             |		КОГДА СостояниеНаВесах.Код ЕСТЬ NULL 
	             |			ТОГДА 1
	             |		ИНАЧЕ 0
	             |	КОНЕЦ КАК Несоответствует
	             |ИЗ
	             |	РегистрСведений.ххх_КодыНоменклатурыВесыКассы КАК СостояниеВБазе
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ххх_КодыНоменклатурыВесыКассыТекущееСостояние КАК СостояниеНаВесах
	             |		ПО (СостояниеНаВесах.Оборудование = СостояниеВБазе.Оборудование)
	             |			И (СостояниеНаВесах.Номенклатура = СостояниеВБазе.Номенклатура)
	             |			И (СостояниеНаВесах.Код = СостояниеВБазе.Код)
	             |ГДЕ
	             |	СостояниеВБазе.Оборудование = &оборудование
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	НомерЯчейки";
	Выборка=Запрос.Выполнить().Выбрать();
	Тз=Запрос.Выполнить().Выгрузить();
	номерКолонки=0;
	Макет=РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");
	й=0;
	Таблица.Очистить();
	Пока выборка.Следующий() Цикл		
		Если номерКолонки = 0 Тогда
		    Область=Макет.ПолучитьОбласть("Область1");
		КонецЕсли;	
		Область.Параметры[номерКолонки]=Выборка.номерЯчейки;					
		номерКолонки=номерКолонки+1;
		Если номерКолонки=8 Тогда
			//Таблица.Вывести(Область);
			Если Тз[й-7].Несоответствует тогда 
				Область.Области.к1.ЦветФона = Новый Цвет (255, 153, 204);
			КонецЕсли;
			Если Тз[й-6].Несоответствует тогда 
				Область.Области.к2.ЦветФона = Новый Цвет (255, 153, 204);
			КонецЕсли;
			Если Тз[й-5].Несоответствует тогда 
				Область.Области.к3.ЦветФона = Новый Цвет (255, 153, 204);
			КонецЕсли;
			Если Тз[й-4].Несоответствует тогда 
				Область.Области.к4.ЦветФона = Новый Цвет (255, 153, 204);
			КонецЕсли;
			Если Тз[й-3].Несоответствует тогда 
				Область.Области.к5.ЦветФона = Новый Цвет (255, 153, 204);
			КонецЕсли;
			Если Тз[й-2].Несоответствует тогда 
				Область.Области.к6.ЦветФона = Новый Цвет (255, 153, 204);
			КонецЕсли;
			Если Тз[й-1].Несоответствует тогда 
				Область.Области.к7.ЦветФона = Новый Цвет (255, 153, 204);
				КонецЕсли;
			Если Тз[й].Несоответствует тогда 
				Область.Области.к8.ЦветФона = Новый Цвет (255, 153, 204);
			КонецЕсли;
			Таблица.Вывести(Область);
			номерКолонки=0;
		КонецЕсли;	
		й=й+1;
	КонецЦикла;
	й=й-1;
	Если номерКолонки<>0 Тогда
		Таблица.Вывести(Область);
		Если Тз[й-7].Несоответствует тогда 
			Область.Области.к1.ЦветФона = Новый Цвет (255, 153, 204);
		КонецЕсли;
		Если Тз[й-6].Несоответствует тогда 
			Область.Области.к2.ЦветФона = Новый Цвет (255, 153, 204);
		КонецЕсли;
		Если Тз[й-5].Несоответствует тогда 
			Область.Области.к3.ЦветФона = Новый Цвет (255, 153, 204);
		КонецЕсли;
		Если Тз[й-4].Несоответствует тогда 
			Область.Области.к4.ЦветФона = Новый Цвет (255, 153, 204);
		КонецЕсли;
		Если Тз[й-3].Несоответствует тогда 
			Область.Области.к5.ЦветФона = Новый Цвет (255, 153, 204);
		КонецЕсли;
		Если Тз[й-2].Несоответствует тогда 
			Область.Области.к6.ЦветФона = Новый Цвет (255, 153, 204);
		КонецЕсли;
		Если Тз[й-1].Несоответствует тогда 
			Область.Области.к7.ЦветФона = Новый Цвет (255, 153, 204);
			КонецЕсли;
		Если Тз[й].Несоответствует тогда 
			Область.Области.к8.ЦветФона = Новый Цвет (255, 153, 204);
		КонецЕсли;

	КонецЕсли;
	//Таблица=Макет;
//	Таблица.Показать();
КонецПроцедуры
